perf_testing/data/composePost/202404260952_90_30s.txt
Running 30s test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/post/compose
  2 threads and 100 connections

  Thread calibration: mean lat.: 1286.273ms, rate sampling interval: 3663ms
  Thread calibration: mean lat.: 1324.954ms, rate sampling interval: 3991ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    11.03s     5.46s   22.23s    64.37%
    Req/Sec    17.40     11.39    38.00     80.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   10.50s 
 75.000%   14.39s 
 90.000%   19.10s 
 99.000%   22.23s 
 99.900%   23.22s 
 99.990%   23.33s 
 99.999%   23.33s 
100.000%   23.33s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      22.031     0.000000            1         1.00
    3643.391     0.100000           70         1.11
    6365.183     0.200000          140         1.25
    8568.831     0.300000          210         1.43
    9986.047     0.400000          279         1.67
   10502.143     0.500000          348         2.00
   10960.895     0.550000          383         2.22
   11616.255     0.600000          418         2.50
   12312.575     0.650000          453         2.86
   13451.263     0.700000          488         3.33
   14385.151     0.750000          522         4.00
   15171.583     0.775000          540         4.44
   16105.471     0.800000          558         5.00
   16891.903     0.825000          575         5.71
   17727.487     0.850000          592         6.67
   18595.839     0.875000          610         8.00
   18841.599     0.887500          620         8.89
   19120.127     0.900000          627        10.00
   19398.655     0.912500          636        11.43
   19808.255     0.925000          644        13.33
   20398.079     0.937500          653        16.00
   20578.303     0.943750          657        17.78
   20938.751     0.950000          662        20.00
   21086.207     0.956250          667        22.86
   21151.743     0.962500          670        26.67
   21266.431     0.968750          675        32.00
   21315.583     0.971875          677        35.56
   21446.655     0.975000          679        40.00
   21512.191     0.978125          681        45.71
   21594.111     0.981250          683        53.33
   21872.639     0.984375          686        64.00
   21938.175     0.985938          687        71.11
   21970.943     0.987500          688        80.00
   22233.087     0.989062          689        91.43
   22249.471     0.990625          690       106.67
   22429.695     0.992188          691       128.00
   22806.527     0.992969          692       142.22
   22806.527     0.993750          692       160.00
   23003.135     0.994531          693       182.86
   23003.135     0.995313          693       213.33
   23117.823     0.996094          694       256.00
   23117.823     0.996484          694       284.44
   23117.823     0.996875          694       320.00
   23216.127     0.997266          695       365.71
   23216.127     0.997656          695       426.67
   23216.127     0.998047          695       512.00
   23216.127     0.998242          695       568.89
   23216.127     0.998437          695       640.00
   23330.815     0.998633          696       731.43
   23330.815     1.000000          696          inf
#[Mean    =    11028.346, StdDeviation   =     5462.588]
#[Max     =    23314.432, Total count    =          696]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  838 requests in 30.05s, 266.48KB read
  Socket errors: connect 0, read 0, write 0, timeout 225
  Non-2xx or 3xx responses: 398
Requests/sec:     27.88  
Transfer/sec:      8.87KB