perf_testing/data/composePost/202404261000_250_30s.txt
Running 30s test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/post/compose
  2 threads and 100 connections

  Thread calibration: mean lat.: 2101.655ms, rate sampling interval: 8384ms
  Thread calibration: mean lat.: 1784.429ms, rate sampling interval: 6385ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    14.80s     5.98s   24.17s    59.41%
    Req/Sec    17.20      4.66    25.00     80.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   13.85s 
 75.000%   20.48s 
 90.000%   22.20s 
 99.000%   24.17s 
 99.900%   26.76s 
 99.990%   26.97s 
 99.999%   26.97s 
100.000%   26.97s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    1190.911     0.000000            1         1.00
    7397.375     0.100000           65         1.11
    9068.543     0.200000          129         1.25
   10133.503     0.300000          194         1.43
   11321.343     0.400000          259         1.67
   13852.671     0.500000          322         2.00
   16736.255     0.550000          354         2.22
   18661.375     0.600000          386         2.50
   19496.959     0.650000          418         2.86
   20070.399     0.700000          456         3.33
   20496.383     0.750000          483         4.00
   20692.991     0.775000          500         4.44
   21004.287     0.800000          515         5.00
   21282.815     0.825000          531         5.71
   21610.495     0.850000          547         6.67
   21872.639     0.875000          563         8.00
   22069.247     0.887500          571         8.89
   22200.319     0.900000          579        10.00
   22413.311     0.912500          587        11.43
   22577.151     0.925000          595        13.33
   22806.527     0.937500          606        16.00
   22822.911     0.943750          607        17.78
   22970.367     0.950000          611        20.00
   23117.823     0.956250          615        22.86
   23314.431     0.962500          619        26.67
   23379.967     0.968750          623        32.00
   23543.807     0.971875          625        35.56
   23658.495     0.975000          627        40.00
   23756.799     0.978125          629        45.71
   23773.183     0.981250          631        53.33
   23969.791     0.984375          633        64.00
   24084.479     0.985938          634        71.11
   24117.247     0.987500          635        80.00
   24150.015     0.989062          636        91.43
   24166.399     0.990625          637       106.67
   24281.087     0.992188          638       128.00
   24297.471     0.992969          639       142.22
   24297.471     0.993750          639       160.00
   24690.687     0.994531          640       182.86
   24690.687     0.995313          640       213.33
   26017.791     0.996094          641       256.00
   26017.791     0.996484          641       284.44
   26017.791     0.996875          641       320.00
   26755.071     0.997266          642       365.71
   26755.071     0.997656          642       426.67
   26755.071     0.998047          642       512.00
   26755.071     0.998242          642       568.89
   26755.071     0.998437          642       640.00
   26968.063     0.998633          643       731.43
   26968.063     1.000000          643          inf
#[Mean    =    14798.390, StdDeviation   =     5977.462]
#[Max     =    26951.680, Total count    =          643]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  804 requests in 30.05s, 256.52KB read
  Socket errors: connect 0, read 0, write 0, timeout 11
  Non-2xx or 3xx responses: 346
Requests/sec:     26.75  
Transfer/sec:      8.54KB