perf_testing/data/composePost/202404261010_450_30s.txt
Running 30s test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/post/compose
  2 threads and 100 connections

  Thread calibration: mean lat.: 1800.348ms, rate sampling interval: 7147ms
  Thread calibration: mean lat.: 1529.043ms, rate sampling interval: 5582ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    14.50s     5.60s   26.30s    58.71%
    Req/Sec    21.00      9.82    35.00     60.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   12.52s 
 75.000%   20.37s 
 90.000%   22.10s 
 99.000%   26.30s 
 99.900%   27.67s 
 99.990%   28.28s 
 99.999%   28.28s 
100.000%   28.28s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    5734.399     0.000000            1         1.00
    8388.607     0.100000           70         1.11
    9347.071     0.200000          141         1.25
   10043.391     0.300000          211         1.43
   10813.439     0.400000          280         1.67
   12517.375     0.500000          350         2.00
   13623.295     0.550000          385         2.22
   15278.079     0.600000          420         2.50
   17547.263     0.650000          455         2.86
   19759.103     0.700000          490         3.33
   20365.311     0.750000          526         4.00
   20643.839     0.775000          544         4.44
   20758.527     0.800000          560         5.00
   21102.591     0.825000          578         5.71
   21397.503     0.850000          595         6.67
   21774.335     0.875000          615         8.00
   21872.639     0.887500          622         8.89
   22102.015     0.900000          631        10.00
   22216.703     0.912500          639        11.43
   22511.615     0.925000          648        13.33
   22888.447     0.937500          658        16.00
   23035.903     0.943750          661        17.78
   23232.511     0.950000          665        20.00
   23511.039     0.956250          670        22.86
   23724.031     0.962500          674        26.67
   24100.863     0.968750          679        32.00
   24379.391     0.971875          681        35.56
   24690.687     0.975000          683        40.00
   25083.903     0.978125          685        45.71
   25296.895     0.981250          687        53.33
   25935.871     0.984375          690        64.00
   26034.175     0.985938          691        71.11
   26198.015     0.987500          692        80.00
   26296.319     0.989062          693        91.43
   26329.087     0.990625          694       106.67
   26689.535     0.992188          695       128.00
   26705.919     0.992969          696       142.22
   26705.919     0.993750          696       160.00
   27115.519     0.994531          697       182.86
   27115.519     0.995313          697       213.33
   27557.887     0.996094          698       256.00
   27557.887     0.996484          698       284.44
   27557.887     0.996875          698       320.00
   27672.575     0.997266          699       365.71
   27672.575     0.997656          699       426.67
   27672.575     0.998047          699       512.00
   27672.575     0.998242          699       568.89
   27672.575     0.998437          699       640.00
   28278.783     0.998633          700       731.43
   28278.783     1.000000          700          inf
#[Mean    =    14499.477, StdDeviation   =     5595.654]
#[Max     =    28262.400, Total count    =          700]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  814 requests in 30.05s, 259.63KB read
  Non-2xx or 3xx responses: 374
Requests/sec:     27.08  
Transfer/sec:      8.64KB