perf_testing/data/composePost/202404261011_470_30s.txt
Running 30s test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/post/compose
  2 threads and 100 connections

  Thread calibration: mean lat.: 2950.656ms, rate sampling interval: 16408ms
  Thread calibration: mean lat.: 2640.240ms, rate sampling interval: 15327ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    15.12s     5.87s   26.21s    58.71%
    Req/Sec    20.00      1.00    21.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   12.99s 
 75.000%   20.73s 
 90.000%   22.92s 
 99.000%   26.21s 
 99.900%   26.82s 
 99.990%   27.20s 
 99.999%   27.20s 
100.000%   27.20s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    5566.463     0.000000            1         1.00
    8142.847     0.100000           73         1.11
    9543.679     0.200000          143         1.25
   10231.807     0.300000          214         1.43
   11173.887     0.400000          285         1.67
   12992.511     0.500000          356         2.00
   14999.551     0.550000          392         2.22
   18087.935     0.600000          428         2.50
   19136.511     0.650000          463         2.86
   20103.167     0.700000          501         3.33
   20725.759     0.750000          534         4.00
   21020.671     0.775000          552         4.44
   21348.351     0.800000          570         5.00
   21774.335     0.825000          588         5.71
   22216.703     0.850000          606         6.67
   22577.151     0.875000          624         8.00
   22806.527     0.887500          633         8.89
   22921.215     0.900000          641        10.00
   23281.663     0.912500          650        11.43
   23691.263     0.925000          659        13.33
   24068.095     0.937500          668        16.00
   24281.087     0.943750          672        17.78
   24510.463     0.950000          677        20.00
   24559.615     0.956250          681        22.86
   24739.839     0.962500          686        26.67
   25198.591     0.968750          690        32.00
   25296.895     0.971875          692        35.56
   25378.815     0.975000          695        40.00
   25444.351     0.978125          697        45.71
   25706.495     0.981250          700        53.33
   25722.879     0.984375          701        64.00
   25985.023     0.985938          702        71.11
   26083.327     0.987500          704        80.00
   26214.399     0.989062          705        91.43
   26263.551     0.990625          706       106.67
   26378.239     0.992188          707       128.00
   26378.239     0.992969          707       142.22
   26558.463     0.993750          708       160.00
   26689.535     0.994531          709       182.86
   26689.535     0.995313          709       213.33
   26738.687     0.996094          710       256.00
   26738.687     0.996484          710       284.44
   26738.687     0.996875          710       320.00
   26820.607     0.997266          711       365.71
   26820.607     0.997656          711       426.67
   26820.607     0.998047          711       512.00
   26820.607     0.998242          711       568.89
   26820.607     0.998437          711       640.00
   27197.439     0.998633          712       731.43
   27197.439     1.000000          712          inf
#[Mean    =    15123.511, StdDeviation   =     5865.727]
#[Max     =    27181.056, Total count    =          712]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  836 requests in 30.05s, 265.81KB read
  Non-2xx or 3xx responses: 387
Requests/sec:     27.82  
Transfer/sec:      8.84KB